Repository: mgKhantt/EasyAPI
Catalog: Sources/EasyAPI/Resources/Localizable.xcstrings
Source language: en
Languages: my, zh_hans

# error.data.corrupted
source: Returned data is corrupted or incomplete.
my: ပြန်လာသော ဒေတာ ပျက်စီးနေခြင်း သို့မဟုတ် မပြည့်စုံပါ။
zh_hans: 返回数据损坏或不完整。

# error.data.decoding
source: Data decoding failed.
my: ဒေတာ ကုဒ်ဖြေခြင်း မအောင်မြင်ပါ။
zh_hans: 数据解码失败。

# error.data.encoding
source: Data encoding failed.
my: ဒေတာ ကုဒ်သွင်းခြင်း မအောင်မြင်ပါ။
zh_hans: 数据编码失败。

# error.data.jsonInvalid
source: Invalid JSON format.
my: JSON ဖွဲ့စည်းပုံ မမှန်ကန်ပါ
zh_hans: JSON格式无效。

# error.network.connectionLost
source: Network connection lost. Please retry.
my: ကွန်ရက်ချိတ်ဆက်မှု ပြတ်တောက်သွားပါသည်။ ထပ်မံကြိုးစားပေးပါ။
zh_hans: 网络连接中断，请重新尝试。

# error.network.dns
source: DNS resolution failed. Please check your connection.
my: DNS ဖြေရှင်းခြင်း မအောင်မြင်ပါ။ သင့်ရဲ့ ချိတ်ဆက်မှုကို စစ်ဆေးပေးပါ။
zh_hans: DNS解析失败，请检查网络连接。

# error.network.ssl
source: SSL secure connection failed.
my: SSL လုံခြုံရေး ချိတ်ဆက်မှု မအောင်မြင်ပါ။
zh_hans: SSL安全连接失败。

# error.network.timeout
source: Network request timed out. Please try again later.
my: ကွန်ရက်တောင်းဆိုမှု အချိန်အကန့်အသတ်ကျော်သွားပါသည်။ နောက်မှထပ်ကြိုးစားပေးပါ။
zh_hans: 网络请求超时，请稍后重试。

# error.network.unavailable
source: No internet connection. Please check your network settings.
my: အင်တာနက်ချိတ်ဆက်မှု မရှိပါ။ သင့်ရဲ့ ကွန်ရက်ချိတ်ဆက်မှုကို စစ်ဆေးပေးပါ။
zh_hans: 网络连接不可用，请检查网络设置。

# error.request.cancelled
source: Request was cancelled.
my: တောင်းဆိုမှု ပယ်ဖျက်လိုက်ပါသည်။
zh_hans: 请求已取消。

# error.request.invalid
source: Invalid request parameters.
my: တောင်းဆိုချက် ပါရာမီတာများ မမှန်ကန်ပါ။
zh_hans: 请求参数无效。

# error.request.timeout
source: Request timed out. Please try again later.
my: တောင်းဆိုမှု အချိန်အကန့်အသတ်ကျော်သွားပါသည်။ နောက်မှထပ်ကြိုးစားပေးပါ။
zh_hans: 网络请求超时，请稍后重试。

# error.response.forbidden
source: Access forbidden. Please check your login status.
my: ၀င်ရောက်ခွင့် တားမြစ်ထားပါသည်။ သင့်ရဲ့ အကောင့်၀င်ရောက်မှုအခြေအနေကို စစ်ဆေးပေးပါ။
zh_hans: 访问被禁止，请检查登录状态。

# error.response.http
source: HTTP protocol error.
my: HTTP ပရိုတိုကော အမှား။
zh_hans: HTTP协议错误。

# error.response.invalid
source: Invalid server response.
my: မမှန်ကန်သော ဆာဗာတုံ့ပြန်ချက်။
zh_hans: 无效的服务器响应。

# error.response.notFound
source: The requested resource was not found.
my: တောင်းဆိုထားသော အရင်းအမြစ်ကို ရှာမတွေ့ပါ။
zh_hans: 请求的资源未找到。

# error.response.server
source: Internal server error. Please try again later.
my: ဆာဗာ အတွင်း အမှား ဖြစ်ပွားပါသည်။ နောက်မှ ပြန်ကြိုးစားပါ။
zh_hans: 服务器内部错误，请稍后重试。

# error.response.serviceUnavailable
source: Service temporarily unavailable. Please try again later.
my: ၀န်ဆောင်မှု ယာယီအားဖြင့် မရနိုင်ပါ။ နောက်မှထပ်ကြိုးစားပေးပါ။
zh_hans: 服务暂时不可用，请稍后重试。

# error.response.unauthorized
source: Your session has expired. Please log in again.
my: ဆက်သွယ်မှု သက်တမ်းကုန်သွားပါသည်။ ထပ်မံ၀င်ရောက်ပေးပါ။
zh_hans: 会话已过期，请重新登录。

# error.unknown
source: An unknown error occurred. Please try again later.
my: မသိသော အမှားတစ်ခု ဖြစ်ပွားခဲ့ပါသည်။ နောက်မှထပ်ကြိုးစားပေးပါ။
zh_hans: 发生未知错误，请稍后重试。

# error.url.invalid
source: Invalid request URL.
my: မမှန်ကန်သော တောင်းဆိုမှု URL။
zh_hans: 无效的请求URL。

# error.url.malformed
source: Malformed request URL.
my: ဖွဲ့စည်းပုံမမှန်သော တောင်းဆိုမှု URL။
zh_hans: URL格式错误。
